In [1]:
import numpy as np
import pandas as pd

labels = ['a', 'b', 'c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [2]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [3]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [4]:

ser1 = pd.Series([1,2,3,4,5,6], ['USA', 'Italy', 'Russia', 'India', 'Thailand', 'Egypt'])
ser1

USA         1
Italy       2
Russia      3
India       4
Thailand    5
Egypt       6
dtype: int64

In [5]:
ser2 = pd.Series([1,2,3,5,6,7], ['USA', 'UAE', 'India', 'Canada', 'UK', 'Jamaica'])
ser2

USA        1
UAE        2
India      3
Canada     5
UK         6
Jamaica    7
dtype: int64

In [6]:
ser2['Jamaica']

7

In [7]:
ser3 = pd.Series(data = labels)

In [8]:
ser3

0    a
1    b
2    c
dtype: object

In [9]:
ser3[0]

'a'

In [10]:
ser1+ser2

Canada      NaN
Egypt       NaN
India       7.0
Italy       NaN
Jamaica     NaN
Russia      NaN
Thailand    NaN
UAE         NaN
UK          NaN
USA         2.0
dtype: float64

In [11]:
from numpy.random import randn
np.random.seed(101)
df = pd.DataFrame(randn(5,4),['A', 'B', 'C', 'D', 'E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [13]:
type(df['W'])

pandas.core.series.Series

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [16]:
df['New'] = df['W'] + df['Y']

In [17]:
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [18]:
df.drop('New',axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [20]:
#Permanently deleted the 'New' cell.
df.drop('New', axis = 1, inplace = True)

In [21]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

# To grab row in dataset.

In [23]:
#row
#Locational-Labelled-Based.
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [24]:
#row method 2->which takes index of a row.
#Numerical Based Index.
df.iloc[3]

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [25]:
#For viewing single value.
df.loc['A','W']

2.706849839399938

In [26]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df.loc[['A','B'], ['Y', 'Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [28]:
np.random.seed(101)

In [29]:
DF1 = pd.DataFrame(randn(5,4),['A','B','C','D','E'], ['W','X','Y','Z'])

In [30]:
DF1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
DF1 > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [32]:
DF1['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [33]:
DF1['X'] < 0

A    False
B     True
C    False
D     True
E    False
Name: X, dtype: bool

In [34]:
DF1[DF1['X'] <0]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [35]:
DF1[DF1['X'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [36]:
DF1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
DF1[DF1['W'] > 0][['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
D -0.933237  0.955057
E  2.605967  0.683509

In [38]:
res = DF1['W'] > 0
myRes = DF1[res]
myCol = ['X','Y']
myRes[myCol]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [39]:
#DF1[(DF1['W'] > 0) and (DF1['Y'] > 1)] -> This will throw valueError - Series is ambigious.
DF1[(DF1['W'] > 0) & (DF1['Z'] > 1)] # '&' is used as and operator here.

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [40]:
DF1[(DF1['W'] > 0) | (DF1['Y'] >1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
DF1.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [42]:
newind = "CA NY WY OR CO".split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [43]:
DF1['RANGE'] = newind

In [44]:
DF1

          W         X         Y         Z RANGE
A  2.706850  0.628133  0.907969  0.503826    CA
B  0.651118 -0.319318 -0.848077  0.605965    NY
C -2.018168  0.740122  0.528813 -0.589001    WY
D  0.188695 -0.758872 -0.933237  0.955057    OR
E  0.190794  1.978757  2.605967  0.683509    CO

In [45]:
DF1.set_index("RANGE")

              W         X         Y         Z
RANGE
CA     2.706850  0.628133  0.907969  0.503826
NY     0.651118 -0.319318 -0.848077  0.605965
WY    -2.018168  0.740122  0.528813 -0.589001
OR     0.188695 -0.758872 -0.933237  0.955057
CO     0.190794  1.978757  2.605967  0.683509

In [46]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [47]:
q = pd.Series([1,2,3,4.7,5,6])
q

0    1.0
1    2.0
2    3.0
3    4.7
4    5.0
5    6.0
dtype: float64

In [48]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [49]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [50]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [51]:
d1f = pd.DataFrame(randn(6,2), hier_index,['A', 'B'])
d1f

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [52]:
d1f.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [53]:
d1f.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [54]:
d1f.index.names

FrozenList([None, None])

In [55]:
d1f.index.names = ['Groups','Key']

In [56]:
d1f

                   A         B
Groups Key
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [57]:
r = d1f.loc['G2'].loc[3]
r

A    0.638787
B    0.329646
Name: 3, dtype: float64

In [58]:
r['B']

0.32964629880452445

In [59]:
r['A']

0.638787013499328

In [60]:
d1f.xs('G1')

            A         B
Key
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [61]:
d1f.xs(1, level = "Key")

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [62]:
d1f

                   A         B
Groups Key
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [63]:
DF1

          W         X         Y         Z RANGE
A  2.706850  0.628133  0.907969  0.503826    CA
B  0.651118 -0.319318 -0.848077  0.605965    NY
C -2.018168  0.740122  0.528813 -0.589001    WY
D  0.188695 -0.758872 -0.933237  0.955057    OR
E  0.190794  1.978757  2.605967  0.683509    CO

# Missing Data

In [64]:
num = {'A': [1,np.nan,3],'B':[2,np.nan,np.nan],'C':[1,2,3],'D':[4,np.nan,6]}
d = pd.DataFrame(num)
d

     A    B  C    D
0  1.0  2.0  1  4.0
1  NaN  NaN  2  NaN
2  3.0  NaN  3  6.0

In [65]:
d.dropna()

     A    B  C    D
0  1.0  2.0  1  4.0

In [66]:
d.dropna(thresh = 2)

     A    B  C    D
0  1.0  2.0  1  4.0
2  3.0  NaN  3  6.0

In [67]:
d.fillna(value = 'Biryani')

         A        B  C        D
0      1.0      2.0  1      4.0
1  Biryani  Biryani  2  Biryani
2      3.0  Biryani  3      6.0

In [68]:
d['D'].fillna(value = d['D'].mean())

0    4.0
1    5.0
2    6.0
Name: D, dtype: float64

# Groupby

In [69]:
n = {'Company' : ['GOOG','MSFT','AMZN','GOOG','FB','MSFT','FB','AMZN'],
    'Employee' : ['Sam','John','Sana','Peter','Smith','Sarah','Black','Jennie'],
    'Sales' :  [150,240,567,900,111,453,897,902]}

In [70]:
p = pd.DataFrame(n)
p

  Company Employee  Sales
0    GOOG      Sam    150
1    MSFT     John    240
2    AMZN     Sana    567
3    GOOG    Peter    900
4      FB    Smith    111
5    MSFT    Sarah    453
6      FB    Black    897
7    AMZN   Jennie    902

In [71]:
byGroup = p.groupby('Company')
byGroup

In [72]:
byGroup.mean()

         Sales
Company
AMZN     734.5
FB       504.0
GOOG     525.0
MSFT     346.5

In [73]:
byGroup.sum()

         Sales
Company
AMZN      1469
FB        1008
GOOG      1050
MSFT       693

In [74]:
byGroup.std()

              Sales
Company
AMZN     236.880772
FB       555.785930
GOOG     530.330086
MSFT     150.613744

In [75]:
byGroup.sum().loc['FB']

Sales    1008
Name: FB, dtype: int64

In [76]:
p.groupby('Company').sum().loc['FB']

Sales    1008
Name: FB, dtype: int64

In [77]:
p.groupby('Company').count()

         Employee  Sales
Company
AMZN            2      2
FB              2      2
GOOG            2      2
MSFT            2      2

In [78]:
p.groupby('Company').max()

        Employee  Sales
Company
AMZN        Sana    902
FB         Smith    897
GOOG         Sam    900
MSFT       Sarah    453

In [79]:
p.groupby('Company').min()

        Employee  Sales
Company
AMZN      Jennie    567
FB         Black    111
GOOG       Peter    150
MSFT        John    240

In [80]:
p.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
AMZN      2.0  734.5  236.880772  567.0  650.75  734.5  818.25  902.0
FB        2.0  504.0  555.785930  111.0  307.50  504.0  700.50  897.0
GOOG      2.0  525.0  530.330086  150.0  337.50  525.0  712.50  900.0
MSFT      2.0  346.5  150.613744  240.0  293.25  346.5  399.75  453.0

In [81]:
p.groupby('Company').describe().transpose()

Company            AMZN         FB        GOOG        MSFT
Sales count    2.000000    2.00000    2.000000    2.000000
      mean   734.500000  504.00000  525.000000  346.500000
      std    236.880772  555.78593  530.330086  150.613744
      min    567.000000  111.00000  150.000000  240.000000
      25%    650.750000  307.50000  337.500000  293.250000
      50%    734.500000  504.00000  525.000000  346.500000
      75%    818.250000  700.50000  712.500000  399.750000
      max    902.000000  897.00000  900.000000  453.000000

In [82]:
p.groupby('Company').describe().transpose()['GOOG']

Sales  count      2.000000
       mean     525.000000
       std      530.330086
       min      150.000000
       25%      337.500000
       50%      525.000000
       75%      712.500000
       max      900.000000
Name: GOOG, dtype: float64

# Merging Joining and Concatenation

In [83]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [84]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [85]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [86]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [87]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [88]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

# Concatenation

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [89]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [90]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

#  Merging

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [91]:
left = pd.DataFrame({'Key': ['K0','K1','K2'],
                    'A' : ['A0','A1','A2'],
                    'B' : ['B0','B1','B2']})

right = pd. DataFrame({'Key' : ['K0','K1','K2'],
                      'C' : ['C0','C1','C2'],
                      'D' : ['D0','D1','D2']})

In [92]:
pd.merge(left,right)

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [93]:
pd.merge(left,right,how = 'inner',on = 'Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [94]:
left = pd.DataFrame({'Key1': ['K0','K1','K2'],
                     'Key2' : ['K4','K5','K6'],
                    'A' : ['A0','A1','A2'],
                    'B' : ['B0','B1','B2']})

right = pd. DataFrame({'Key1' : ['K0','K1','K2'],
                       'Key2' : ['K4','K5','K6'],
                      'C' : ['C0','C1','C2'],
                      'D' : ['D0','D1','D2']})

In [95]:
pd.merge(left,right,how = 'outer',on = ['Key1','Key2'])

  Key1 Key2   A   B   C   D
0   K0   K4  A0  B0  C0  D0
1   K1   K5  A1  B1  C1  D1
2   K2   K6  A2  B2  C2  D2

In [96]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                         'C': ['C0', 'C1', 'C2', 'C3'],
                         'D': ['D0', 'D1', 'D2', 'D3']})

In [97]:
pd.merge(left,right,how = 'outer',on = ['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [98]:
pd.merge(left, right,how = 'left',on = ['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [99]:
pd.merge(left,right,how = 'right',on = ['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

# Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.#

In [100]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [101]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [102]:
left.join(right,how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Input/Output
CSV /
HTML /
Excel /
SQL

In [103]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [104]:
new = pd.read_csv('example')

In [105]:
new

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [106]:
new.to_csv("My Output")

In [107]:
pd.read_csv('My Output')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [108]:
new.to_csv("My Output",index = False)

In [109]:
pd.read_csv("My Output")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [110]:
pd.read_excel('Excel_Sample.xlsx')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [111]:
new.to_excel('Excel_Smaple2.xlsx', sheet_name='NewSheet')

In [112]:
df = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [113]:
df

[                         Bank NameBank           CityCity StateSt  CertCert  \
 0                    Almena State Bank             Almena      KS     15426
 1           First City Bank of Florida  Fort Walton Beach      FL     16748
 2                 The First State Bank      Barboursville      WV     14361
 3                   Ericson State Bank            Ericson      NE     18265
 4     City National Bank of New Jersey             Newark      NJ     21111
 ..                                 ...                ...     ...       ...
 558                 Superior Bank, FSB           Hinsdale      IL     32646
 559                Malta National Bank              Malta      OH      6629
 560    First Alliance Bank & Trust Co.         Manchester      NH     34264
 561  National State Bank of Metropolis         Metropolis      IL      3815
 562                   Bank of Honolulu           Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0                            Equity Bank    October 23, 2020     10538
 1              United Fidelity Bank, fsb    October 16, 2020     10537
 2                         MVB Bank, Inc.       April 3, 2020     10536
 3             Farmers and Merchants Bank   February 14, 2020     10535
 4                        Industrial Bank    November 1, 2019     10534
 ..                                   ...                 ...       ...
 558                Superior Federal, FSB       July 27, 2001      6004
 559                    North Valley Bank         May 3, 2001      4648
 560  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 561              Banterra Bank of Marion   December 14, 2000      4646
 562                   Bank of the Orient    October 13, 2000      4645

 [563 rows x 7 columns]]

In [114]:
type(df)

list

In [115]:
df[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

# SQL

In [116]:
num = pd.read_csv('example')
num

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [127]:
from sqlalchemy import create_engine

In [141]:
Engine = create_engine('sqlite:///:memory:')

In [142]:
num.to_sql('data', Engine)

4